bench/results/server1/Spock-0.6.2.1/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.72ms   55.59ms 852.60ms   98.87%
    Req/Sec     3.30k   653.96     7.14k    90.01%
  758297 requests in 30.00s, 147.53MB read
Requests/sec:  25274.05
Transfer/sec:      4.92MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.71ms    2.75ms 428.43ms   89.95%
    Req/Sec     3.28k   699.01     8.41k    83.33%
  752176 requests in 30.00s, 146.34MB read
Requests/sec:  25070.40
Transfer/sec:      4.88MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.49ms   31.57ms 659.57ms   99.72%
    Req/Sec     3.21k   773.02     6.84k    71.59%
  749431 requests in 30.00s, 145.80MB read
Requests/sec:  24983.08
Transfer/sec:      4.86MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.73ms   46.31ms 786.75ms   99.60%
    Req/Sec     3.21k   797.90     8.17k    77.29%
  747292 requests in 30.00s, 145.39MB read
Requests/sec:  24912.66
Transfer/sec:      4.85MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.69ms   40.10ms 821.59ms   99.73%
    Req/Sec     3.30k   605.97     9.27k    86.19%
  756276 requests in 30.01s, 147.13MB read
Requests/sec:  25204.60
Transfer/sec:      4.90MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.71ms   51.71ms 836.15ms   99.35%
    Req/Sec     3.26k   807.91     7.75k    83.23%
  753256 requests in 30.00s, 146.55MB read
Requests/sec:  25109.36
Transfer/sec:      4.89MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.47ms   23.62ms 365.24ms   99.50%
    Req/Sec     3.28k   584.76     7.80k    88.98%
  749263 requests in 30.00s, 145.77MB read
Requests/sec:  24972.19
Transfer/sec:      4.86MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.99ms   21.37ms 390.80ms   99.62%
    Req/Sec     3.24k   731.28     8.38k    80.89%
  747188 requests in 30.00s, 145.37MB read
  Socket errors: connect 0, read 0, write 0, timeout 70
Requests/sec:  24905.28
Transfer/sec:      4.85MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.45ms   21.96ms 544.66ms   99.31%
    Req/Sec     3.24k   750.76     8.18k    81.92%
  750591 requests in 30.00s, 146.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 47
Requests/sec:  25022.28
Transfer/sec:      4.87MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.81ms    4.93ms 607.39ms   96.99%
    Req/Sec     3.28k   634.46     8.43k    86.34%
  750424 requests in 30.00s, 145.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 30
Requests/sec:  25012.03
Transfer/sec:      4.87MB
=================== summary ===================
ghc version:  7.8.2
bench target: Spock-0.6.2.1
bench:        PARAM
bench mode:   30s * 10
average:      25046.59
stdev:        120.40
=================== oneline ===================
7.8.2,Spock-0.6.2.1,PARAM,30s,10,25046.59,120.40